In [1]:
import pandas as pd

#### merge() - The merge() function in Pandas combines two DataFrame or named Series objects based on columns or indexes. The result is a new DataFrame containing data from both original DataFrames, while the source DataFrames remain unchanged.

##### merge(left, right, on, how, left/right_on, left/right_index, suffixes)
* on: default consider same name column
* how- left/right/inner/outer/cross................ default- inner
* left_on/ right_on: Specify the column names from the left/right DataFrame to use when the column names differ.

In [28]:
data1 = {
    'EmployeeID': [1,2,3,4],
    'Name': ['Alice', 'Bob', 'Charlie', 'DAvid'],
    'DeptID': ['D001', 'D002', 'D001', 'D555']
}

df1 = pd.DataFrame(data1)

In [29]:
df1

   EmployeeID     Name DeptID
0           1    Alice   D001
1           2      Bob   D002
2           3  Charlie   D001
3           4    DAvid   D555

In [30]:
data2 = {
    'DeptID': ['D001', 'D002'],
    'DeptName': ['Sales', 'Marketing']
}
df2 = pd.DataFrame(data2)

In [31]:
df2

  DeptID   DeptName
0   D001      Sales
1   D002  Marketing

In [52]:
pd.merge(df1, df2, how='cross')

   EmployeeID     Name DeptID_x DeptID_y   DeptName
0           1    Alice     D001     D001      Sales
1           1    Alice     D001     D002  Marketing
2           2      Bob     D002     D001      Sales
3           2      Bob     D002     D002  Marketing
4           3  Charlie     D001     D001      Sales
5           3  Charlie     D001     D002  Marketing
6           4    DAvid     D555     D001      Sales
7           4    DAvid     D555     D002  Marketing

##### left_on/ right_on

In [39]:
df3 = pd.DataFrame({'EmpID': [4, 3, 1, 4], 'Salary': [50000, 60000, 70000, 25000]})
df3

   EmpID  Salary
0      4   50000
1      3   60000
2      1   70000
3      4   25000

In [40]:
pd.merge(df1, df3, left_on = 'EmployeeID', right_on = 'EmpID', sort = True)

   EmployeeID     Name DeptID  EmpID  Salary
0           1    Alice   D001      1   70000
1           3  Charlie   D001      3   60000
2           4    DAvid   D555      4   50000
3           4    DAvid   D555      4   25000

#### multiple col_name- same; suffixes specify Tuple of string suffixes to apply to overlapping column names

In [47]:
    df_a = pd.DataFrame({'ID': [1, 2, 4], 'col_2': [10, 20, 13]})
    df_b = pd.DataFrame({'ID': [1, 3, 2], 'col_2': [15, 25, 20]})
    merged_suffixes = pd.merge(df_a, df_b, on='ID', suffixes=('_dfA', '_dfB'))
    print(merged_suffixes)

   ID  col_2_dfA  col_2_dfB
0   1         10         15
1   2         20         20